cf/acc/1.2.2.56/Documents/ПроверкаВерсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ПроверкаВерсии</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияАПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Версии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияХранилища</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эталон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Версии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖурналПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееВремя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнаруженоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверяемыеОбъекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьВсеОшибкиКакОсобенности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставПравил</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХешСумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставТребований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Требование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Требования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбнаруживаемыеОшибки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/acc/1.2.2.56/Documents/ПроверкаВерсии/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область Обработчики

// Выполняет проверку конфигурации в соответствии с переданным списком требований.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Результат = ИнтеграцияССППР.ИнициализироватьСтруктуруДляИнтеграцииВСППР(Конфигурация);
	Если НЕ Результат.Успешно Тогда
		Сообщить(Результат.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	СтруктураПроверкиДляРегистрацииВСППР = Результат.СтруктураПроверкиДляРегистрацииВСППР;
	
	ТаблицаЖурнала = Проверка.ИнициализироватьТаблицуЖурналаПроверки();
	
	СтруктураПроверки = Новый Структура;
	СтруктураПроверки.Вставить("ПроверкаВерсии", ЭтотОбъект);
	СтруктураПроверки.Вставить("ТаблицаЖурнала",  ТаблицаЖурнала);
	
	Сценарий = Конфигурация.Сценарий;
	Если (Сценарий = 0) ИЛИ (Сценарий = 2) Тогда
		Проверка.ОбработкаПроведенияДокументаПроверки(СтруктураПроверки, СтруктураПроверкиДляРегистрацииВСППР);
	КонецЕсли;
	
	Если Сценарий > 0 Тогда
		Для Каждого СтрокаРасширения Из Конфигурация.Расширения Цикл
			Расширение = СтрокаРасширения.Расширение;
			Проверка.ОбработкаПроведенияДокументаПроверки(СтруктураПроверки, СтруктураПроверкиДляРегистрацииВСППР, Расширение);
		КонецЦикла;
	КонецЕсли;
	
	Проверка.СортироватьЖурналПроверки(ЭтотОбъект, СтруктураПроверки);
	
КонецПроцедуры

// Обработчик перед записью документа. Синхронизирует информацию конфигурации по версии.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВерсияКонфигурации.Владелец <> Конфигурация Тогда
		Конфигурация = ВерсияКонфигурации.Владелец;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
